Repository: jairofilho79/coldigom
Catalog: frontend-flutter/lib/l10n/app_*.arb
Languages: pt

# appName
source: Coldigom
pt: Coletânea Digital

# appSubtitle
source: Praise Management
pt: com <3 pela ID (Irmãos da Maranata)

# buttonBack
source: Back
pt: Voltar

# buttonEdit
source: Edit
pt: Editar

# buttonDelete
source: Delete
pt: Deletar

# buttonSave
source: Save
pt: Salvar

# buttonCancel
source: Cancel
pt: Cancelar

# buttonCreate
source: Create
pt: Criar

# buttonUpdate
source: Update
pt: Atualizar

# buttonConfirm
source: Confirm
pt: Confirmar

# buttonClose
source: Close
pt: Fechar

# buttonLogout
source: Logout
pt: Sair

# buttonRemoveFilter
source: Remove Filter
pt: Remover Filtro

# buttonDownload
source: Download
pt: Baixar

# buttonDownloading
source: Downloading...
pt: Baixando...

# buttonDownloadZip
source: Download ZIP
pt: Baixar ZIP

# buttonEnter
source: Sign In
pt: Entrar

# buttonRegister
source: Register
pt: Registrar

# buttonTryAgain
source: Try Again
pt: Tentar Novamente

# labelTags
source: Tags
pt: Etiquetas

# labelMaterials
source: Materials
pt: Materiais

# labelName
source: Name
pt: Nome

# labelPassword
source: Password
pt: Senha

# labelConfirmPassword
source: Confirm Password
pt: Confirmar Senha

# labelUsername
source: Username
pt: Usuário

# labelType
source: Type
pt: Tipo

# labelMaterialKind
source: Material Kind
pt: Categoria do Material

# labelMaterialType
source: Material Type
pt: Tipo do Material

# labelPath
source: Path
pt: Caminho

# labelSearch
source: Search
pt: Buscar

# labelPraiseName
source: Praise Name
pt: Nome do Louvor

# labelNumber
source: Number
pt: Número

# labelNumberOptional
source: Number (optional)
pt: Número (opcional)

# labelFileType
source: File Type
pt: Tipo de Arquivo

# labelCode
source: Code
pt: Código

# labelLanguage
source: Language
pt: Idioma

# labelTranslatedName
source: Translated Name
pt: Nome Traduzido

# labelEntityType
source: Entity Type
pt: Tipo de Entidade

# labelFilters
source: Filters
pt: Filtros

# labelAllLanguages
source: All languages
pt: Todos os idiomas

# labelPraiseTag
source: Praise Tag
pt: Etiqueta do louvor

# labelText
source: Text
pt: Texto

# labelActive
source: Active
pt: Ativa

# labelMaterialKindRequired
source: Material Kind *
pt: Categoria do Material *

# labelMaterialTypeRequired
source: Material Type *
pt: Tipo do Material *

# labelSelectMaterialKind
source: Select Material Kind
pt: Selecione a categoria do material

# labelSelectFile
source: Select File
pt: Selecionar Arquivo

# labelSelectNewFile
source: Select New File
pt: Selecionar Novo Arquivo

# labelCurrentFile
source: Current File
pt: Arquivo Atual

# labelMaxZipSize
source: Maximum ZIP size (MB)
pt: Tamanho máximo por ZIP (MB)

# labelMaterialIsOld
source: Old Material
pt: Material Antigo

# labelMaterialOldDescription
source: Old Material Description
pt: Descrição do Material Antigo

# labelSelectTag
source: Select a tag (optional)
pt: Selecione uma etiqueta (opcional)

# labelSelectMaterialKindForDownload
source: Select a Material Kind
pt: Selecione uma Categoria do Material

# labelDescription
source: Description
pt: Descrição

# labelPublic
source: Public
pt: Pública

# labelPrivate
source: Private
pt: Privada

# labelOwner
source: Owner
pt: Dono

# labelDateFrom
source: Date From
pt: Data Inicial

# labelDateTo
source: Date To
pt: Data Final

# hintEnterUsername
source: Enter your username
pt: Digite seu usuário

# hintEnterPassword
source: Enter your password
pt: Digite sua senha

# hintEnterEmail
source: Enter your email
pt: Digite seu email

# hintConfirmPassword
source: Confirm your password
pt: Confirme sua senha

# hintEnterPraiseName
source: Enter praise name
pt: Digite o nome do louvor

# hintEnterPraiseNumber
source: Enter praise number (optional)
pt: Digite o número do louvor (opcional)

# hintEnterTagName
source: Enter tag name
pt: Digite o nome da etiqueta

# hintEnterMaterialKindName
source: Enter material kind name
pt: Digite o nome da Categoria do Material

# hintEnterMaterialTypeName
source: Enter material type name
pt: Digite o nome do Tipo do Material

# hintEnterLanguageName
source: Enter language name
pt: Digite o nome da linguagem

# hintEnterTranslatedName
source: Enter translated name
pt: Digite o nome traduzido

# hintEnterSearchPraise
source: Enter praise name...
pt: Digite o nome do louvor...

# hintEnterListName
source: Enter list name
pt: Digite o nome da lista

# hintEnterListDescription
source: Enter list description (optional)
pt: Digite a descrição da lista (opcional)

# hintEnterUrl
source: Paste {platform} URL
pt: Cole a URL do {platform}

# hintEnterText
source: Enter material text
pt: Digite o texto do material

# hintEnterOldDescription
source: Describe why this material is old (optional)
pt: Descreva por que este material está antigo (opcional)

# hintEnterReviewDescription
source: Describe the reason for review...
pt: Descreva o motivo da revisão...

# hintSelectFile
source: Select a PDF or audio file
pt: Selecione um arquivo PDF ou de áudio

# hintSelectNewFileToReplace
source: Select a new file to replace
pt: Selecione um novo arquivo para substituir

# validationRequired
source: This field is required
pt: Este campo é obrigatório

# validationTranslatedNameRequired
source: Translated name is required
pt: O nome traduzido é obrigatório

# validationMinLength
source: Minimum of {min} characters
pt: Mínimo de {min} caracteres

# validationMaxLength
source: Maximum of {max} characters
pt: Máximo de {max} caracteres

# validationEnterUsername
source: Please enter your username
pt: Por favor, digite seu usuário

# validationEnterPassword
source: Please enter your password
pt: Por favor, digite sua senha

# validationEnterEmail
source: Please enter your email
pt: Por favor, digite seu email

# validationValidEmail
source: Please enter a valid email
pt: Por favor, digite um email válido

# validationUsernameMinLength
source: Username must be at least 3 characters
pt: Usuário deve ter pelo menos 3 caracteres

# validationPasswordMinLength
source: Password must be at least 6 characters
pt: Senha deve ter pelo menos 6 caracteres

# validationConfirmPassword
source: Please confirm your password
pt: Por favor, confirme sua senha

# validationPasswordMismatch
source: Passwords do not match
pt: As senhas não coincidem

# validationUrlRequired
source: URL is required
pt: URL é obrigatória

# validationUrlInvalid
source: Invalid URL
pt: URL inválida

# validationTextRequired
source: Text is required
pt: Texto é obrigatório

# validationMaterialKindRequired
source: Material Kind is required
pt: Categoria do Material é obrigatório

# validationSelectMaterialType
source: Select material type
pt: Selecione o Tipo do Material

# validationSelectMaterialKind
source: Select Material Kind
pt: Selecione a Categoria do Material

# validationListNameRequired
source: List name is required
pt: Nome da lista é obrigatório

# pageTitleDashboard
source: Dashboard
pt: Início

# pageTitlePraises
source: Praises
pt: Louvores

# pageTitleTags
source: Tags
pt: Etiquetas

# pageTitleMaterialKinds
source: Material Kinds
pt: Categorias do Material

# pageTitleMaterialTypes
source: Material Types
pt: Tipos do Material

# pageTitleLanguages
source: Languages
pt: Linguagens

# pageTitleCreatePraise
source: Create Praise
pt: Criar Louvor

# pageTitleEditPraise
source: Edit Praise
pt: Editar Louvor

# pageTitlePraiseDetails
source: Praise Details
pt: Detalhes do Louvor

# pageTitleRegister
source: Register
pt: Registro

# pageTitleCreateTag
source: Create Tag
pt: Criar Etiqueta

# pageTitleEditTag
source: Edit Tag
pt: Editar Etiqueta

# pageTitleCreateMaterialKind
source: Create Material Kind
pt: Criar Categoria do Material

# pageTitleEditMaterialKind
source: Edit Material Kind
pt: Editar Categoria do Material

# pageTitleCreateMaterialType
source: Create Material Type
pt: Criar Tipo do Material

# pageTitleEditMaterialType
source: Edit Material Type
pt: Editar Tipo do Material

# pageTitleCreateLanguage
source: Create Language
pt: Criar Linguagem

# pageTitleEditLanguage
source: Edit Language
pt: Editar Linguagem

# pageTitleTranslations
source: Translations
pt: Traduções

# pageTitleCreateTranslation
source: Create Translation
pt: Criar Tradução

# pageTitleEditTranslation
source: Edit Translation
pt: Editar Tradução

# pageTitlePraiseLists
source: Praise Lists
pt: Listas de Louvores

# pageTitlePraiseListDetail
source: List Details
pt: Detalhes da Lista

# pageTitlePraiseListCreate
source: Create List
pt: Criar Lista

# pageTitlePraiseListEdit
source: Edit List
pt: Editar Lista

# messageWelcome
source: Welcome, {username}!
pt: Bem-vindo, {username}!

# messageNotAuthenticated
source: Not authenticated
pt: Não autenticado

# messageNoTagsAvailable
source: No tags available
pt: Nenhuma etiqueta disponível

# messageNoMaterialsAdded
source: No materials added
pt: Nenhum material adicionado

# messageNoMaterialKindsAvailable
source: No Material Kinds available
pt: Nenhum Categoria do Material disponível

# messageNoTagsForFilter
source: No tag (all praises)
pt: Nenhuma etiqueta (todos os louvores)

# messageNoMaterials
source: No materials registered
pt: Nenhum material cadastrado

# messageNoTranslationsAvailable
source: No translations available
pt: Nenhuma tradução disponível

# messageNoLists
source: No lists found
pt: Nenhuma lista encontrada

# messageNoListsFound
source: No lists found with applied filters
pt: Nenhuma lista encontrada com os filtros aplicados

# messageNoPraisesInList
source: No praises in this list
pt: Nenhum louvor nesta lista

# messageUnknown
source: Unknown
pt: Desconhecido

# messageCreatePraiseFirst
source: You need to create the praise first
pt: É necessário criar o louvor primeiro

# messageFileSelected
source: New file selected. Current file will be replaced.
pt: Novo arquivo selecionado. O arquivo atual será substituído.

# messageNewFile
source: New File: {fileName}
pt: Novo Arquivo: {fileName}

# messageVersion
source: Version: {version} ({buildNumber})
pt: Versão: {version} ({buildNumber})

# messageNoAccount
source: Don't have an account? Register
pt: Não tem conta? Registre-se

# messageHasAccount
source: Already have an account? Sign in
pt: Já tem conta? Faça login

# messageLanguageAvailable
source: Language available for use
pt: Linguagem disponível para uso

# messageMaterialOld
source: Mark if this material is outdated
pt: Marcar se este material está desatualizado

# messageZipSaved
source: ZIP saved at: {path}
pt: ZIP salvo em: {path}

# messagePageOf
source: Page {current} of {total}
pt: Página {current} de {total}

# messageCode
source: Code: {code}
pt: Código: {code}

# sectionTags
source: Tags
pt: Etiquetas

# sectionMaterials
source: Materials
pt: Materiais

# sectionReviewHistory
source: Review History
pt: Histórico de Revisão

# statusInReview
source: In Review
pt: Em Revisão

# statusLoading
source: Loading...
pt: Carregando...

# statusDownloadingZip
source: Downloading ZIP...
pt: Baixando ZIP...

# badgeInReview
source: In Review
pt: Em Revisão

# badgeOld
source: Old
pt: Antigo

# actionAddMaterial
source: Add Material
pt: Adicionar Material

# actionEdit
source: Edit
pt: Editar

# actionDelete
source: Delete
pt: Excluir

# actionDownload
source: Download
pt: Baixar

# actionPlay
source: Play
pt: Reproduzir

# actionView
source: View
pt: Visualizar

# actionStartReview
source: Start Review
pt: Iniciar Revisão

# actionCancelReview
source: Cancel Review
pt: Cancelar Revisão

# actionFinishReview
source: Finish Review
pt: Finalizar Revisão

# actionFilter
source: Filter
pt: Filtrar

# actionAll
source: All
pt: Todas

# actionViewOldMaterials
source: View Old
pt: Ver Antigos

# actionHideOldMaterials
source: Hide Old
pt: Ocultar Antigos

# actionAddTranslation
source: Add Translation
pt: Adicionar Tradução

# actionNewList
source: New List
pt: Nova Lista

# actionCreateFirstList
source: Create first list
pt: Criar primeira lista

# actionFollow
source: Follow
pt: Seguir

# actionUnfollow
source: Unfollow
pt: Deixar de Seguir

# actionCopy
source: Copy
pt: Copiar

# actionCopyList
source: Copy List
pt: Copiar Lista

# actionAddToList
source: Add to List
pt: Adicionar à Lista

# actionRemoveFromList
source: Remove from List
pt: Remover da Lista

# actionMoveUp
source: Move Up
pt: Mover para Cima

# actionMoveDown
source: Move Down
pt: Mover para Baixo

# actionClearFilters
source: Clear Filters
pt: Limpar Filtros

# dialogTitleConfirmDelete
source: Confirm Deletion
pt: Confirmar Exclusão

# dialogTitleStartReview
source: Start Review
pt: Iniciar Revisão

# dialogTitleDownloadZip
source: Download Praise as ZIP
pt: Baixar Louvor em ZIP

# dialogMessageDeletePraise
source: Are you sure you want to delete this praise? This action cannot be undone.
pt: Tem certeza que deseja excluir este louvor? Esta ação não pode ser desfeita.

# dialogMessageDeleteTag
source: Are you sure you want to delete this tag?
pt: Tem certeza que deseja excluir esta etiqueta?

# dialogMessageDeleteMaterialKind
source: Are you sure you want to delete this material kind?
pt: Tem certeza que deseja excluir esta categoria do material?

# dialogMessageDeleteMaterialType
source: Are you sure you want to delete this material type?
pt: Tem certeza que deseja excluir este tipo do material?

# dialogMessageDeleteLanguage
source: Are you sure you want to delete this language?
pt: Tem certeza que deseja excluir esta linguagem?

# dialogMessageDeleteTranslation
source: Are you sure you want to delete this translation?
pt: Tem certeza que deseja excluir esta tradução?

# dialogMessageDeleteMaterial
source: Are you sure you want to delete this material?
pt: Tem certeza que deseja excluir este material?

# dialogMessageDeletePraiseList
source: Are you sure you want to delete this list? This action cannot be undone.
pt: Tem certeza que deseja excluir esta lista? Esta ação não pode ser desfeita.

# dialogMessageRemovePraiseFromList
source: Are you sure you want to remove this praise from the list?
pt: Tem certeza que deseja remover este louvor da lista?

# dialogMessageNoFileMaterials
source: This praise has no file materials for download
pt: Este louvor não possui materiais de arquivo para download

# dialogLabelReviewDescription
source: Description (optional)
pt: Descrição (opcional)

# errorConnectionFailed
source: Could not connect to server. Make sure the backend is running at http://127.0.0.1:8000
pt: Não foi possível conectar ao servidor. Verifique se o backend está rodando.

# errorInvalidCredentials
source: Incorrect username or password
pt: Usuário ou senha incorretos

# errorLogin
source: Error logging in: {error}
pt: Erro ao fazer login: {error}

# errorRegister
source: Error registering: {error}
pt: Erro ao registrar: {error}

# errorSelectFile
source: Error selecting file: {error}
pt: Erro ao selecionar arquivo: {error}

# errorSaveMaterial
source: Error saving material: {error}
pt: Erro ao salvar material: {error}

# errorDeleteMaterial
source: Error deleting material: {error}
pt: Erro ao excluir material: {error}

# errorLoadMaterials
source: Error loading materials: {error}
pt: Erro ao carregar materiais: {error}

# errorDownloadZip
source: Error downloading ZIP: {error}
pt: Erro ao baixar ZIP: {error}

# errorLoadPraise
source: Error loading praise: {error}
pt: Erro ao carregar o louvor: {error}

# errorLoadMaterialKind
source: Error loading material kind: {error}
pt: Erro ao carregar categoria do material: {error}

# errorLoadMaterialType
source: Error loading material type: {error}
pt: Erro ao carregar tipo do material: {error}

# errorLoadAudio
source: Error loading audio: {error}
pt: Erro ao carregar áudio: {error}

# errorLoadPdf
source: Error loading PDF
pt: Erro ao carregar PDF

# errorCreatePraise
source: Error creating praise: {error}
pt: Erro ao criar o louvor: {error}

# errorUpdatePraise
source: Error updating praise: {error}
pt: Erro ao atualizar o louvor: {error}

# errorDeletePraise
source: Error deleting: {error}
pt: Erro ao excluir: {error}

# errorStartReview
source: Error starting review: {error}
pt: Erro ao iniciar revisão: {error}

# errorCancelReview
source: Error canceling review: {error}
pt: Erro ao cancelar revisão: {error}

# errorFinishReview
source: Error finishing review: {error}
pt: Erro ao finalizar revisão: {error}

# errorSaveTag
source: Error saving tag: {error}
pt: Erro ao salvar etiqueta: {error}

# errorDeleteTag
source: Error deleting tag: {error}
pt: Erro ao excluir etiqueta: {error}

# errorSaveMaterialKind
source: Error saving material kind: {error}
pt: Erro ao salvar categoria do material: {error}

# errorDeleteMaterialKind
source: Error deleting material kind: {error}
pt: Erro ao excluir categoria do material: {error}

# errorSaveMaterialType
source: Error saving material type: {error}
pt: Erro ao salvar tipo do material: {error}

# errorDeleteMaterialType
source: Error deleting material type: {error}
pt: Erro ao excluir tipo do material: {error}

# errorSaveLanguage
source: Error saving language: {error}
pt: Erro ao salvar linguagem: {error}

# errorDeleteLanguage
source: Error deleting language: {error}
pt: Erro ao excluir linguagem: {error}

# errorDeleteTranslation
source: Error deleting translation: {error}
pt: Erro ao excluir tradução: {error}

# errorSaveTranslation
source: Error saving translation: {error}
pt: Erro ao salvar tradução: {error}

# errorLoadTranslation
source: Error loading translation: {error}
pt: Erro ao carregar tradução: {error}

# errorLoadPraiseList
source: Error loading list: {error}
pt: Erro ao carregar lista: {error}

# errorCreatePraiseList
source: Error creating list: {error}
pt: Erro ao criar lista: {error}

# errorUpdatePraiseList
source: Error updating list: {error}
pt: Erro ao atualizar lista: {error}

# errorDeletePraiseList
source: Error deleting list: {error}
pt: Erro ao excluir lista: {error}

# errorAddPraiseToList
source: Error adding praise to list: {error}
pt: Erro ao adicionar louvor à lista: {error}

# errorRemovePraiseFromList
source: Error removing praise from list: {error}
pt: Erro ao remover louvor da lista: {error}

# errorFollowList
source: Error following list: {error}
pt: Erro ao seguir lista: {error}

# errorUnfollowList
source: Error unfollowing list: {error}
pt: Erro ao deixar de seguir lista: {error}

# errorCopyList
source: Error copying list: {error}
pt: Erro ao copiar lista: {error}

# errorNeedCreatePraiseFirst
source: Praise must be created first
pt: É necessário criar o louvor primeiro

# errorDownloadCanceled
source: Download canceled
pt: Download cancelado

# successRegister
source: Registration successful! Please login.
pt: Registro realizado com sucesso! Faça login.

# successPraiseCreated
source: Praise created successfully. You can add materials on the edit page.
pt: Louvor criado com sucesso. Você pode adicionar materiais na página de edição.

# successPraiseUpdated
source: Praise updated successfully
pt: Louvor atualizado com sucesso

# successPraiseDeleted
source: Praise deleted successfully
pt: Louvor excluído com sucesso

# successReviewStarted
source: Review started successfully
pt: Revisão iniciada com sucesso

# successReviewCanceled
source: Review canceled successfully
pt: Revisão cancelada com sucesso

# successReviewFinished
source: Review finished successfully
pt: Revisão finalizada com sucesso

# successMaterialDeleted
source: Material deleted successfully
pt: Material excluído com sucesso

# successTagSaved
source: Tag saved successfully
pt: Etiqueta salva com sucesso

# successTagDeleted
source: Tag deleted successfully
pt: Etiqueta excluída com sucesso

# successMaterialKindSaved
source: Material kind saved successfully
pt: categoria do material salvo com sucesso

# successMaterialKindDeleted
source: Material kind deleted successfully
pt: categoria do material excluído com sucesso

# successMaterialTypeSaved
source: Material type saved successfully
pt: Tipo do Material salvo com sucesso

# successMaterialTypeDeleted
source: Material type deleted successfully
pt: Tipo do Material excluído com sucesso

# successLanguageSaved
source: Language saved successfully
pt: Linguagem salva com sucesso

# successLanguageDeleted
source: Language deleted successfully
pt: Linguagem excluída com sucesso

# successTranslationSaved
source: Translation saved successfully
pt: Tradução salva com sucesso

# successTranslationDeleted
source: Translation deleted successfully
pt: Tradução excluída com sucesso

# successPraiseListCreated
source: List created successfully
pt: Lista criada com sucesso

# successPraiseListUpdated
source: List updated successfully
pt: Lista atualizada com sucesso

# successPraiseListDeleted
source: List deleted successfully
pt: Lista excluída com sucesso

# successPraiseAddedToList
source: Praise added to list successfully
pt: Louvor adicionado à lista com sucesso

# successPraiseRemovedFromList
source: Praise removed from list successfully
pt: Louvor removido da lista com sucesso

# successListFollowed
source: List followed successfully
pt: Lista seguida com sucesso

# successListUnfollowed
source: Unfollowed list successfully
pt: Deixou de seguir a lista com sucesso

# successListCopied
source: List copied successfully
pt: Lista copiada com sucesso

# enumMaterialFormTypeFile
source: File
pt: Arquivo

# enumMaterialFormTypeText
source: Text
pt: Texto

# enumRoomAccessTypePublic
source: Public
pt: Público

# enumRoomAccessTypePassword
source: With Password
pt: Com Senha

# enumRoomAccessTypeApproval
source: With Approval
pt: Com Aprovação

# enumRoomJoinRequestStatusPending
source: Pending
pt: Pendente

# enumRoomJoinRequestStatusApproved
source: Approved
pt: Aprovado

# enumRoomJoinRequestStatusRejected
source: Rejected
pt: Rejeitado

# reviewActionStart
source: Start
pt: Iniciar

# reviewActionCancel
source: Cancel
pt: Cancelar

# reviewActionFinish
source: Finish
pt: Finalizar

# tooltipDownloadZip
source: Download ZIP
pt: Baixar ZIP

# tooltipEdit
source: Edit
pt: Editar

# tooltipDelete
source: Delete
pt: Excluir

# drawerUser
source: User
pt: Usuário

# drawerPraises
source: Praises
pt: Louvores

# drawerTags
source: Tags
pt: Etiquetas

# drawerLanguages
source: Languages
pt: Linguagens

# drawerLanguage
source: Language
pt: Idioma

# drawerMaterialKinds
source: Material Kinds
pt: Categorias do Material

# drawerMaterialTypes
source: Material Types
pt: Tipos do Material

# drawerTranslations
source: Translations
pt: Traduções

# drawerPraiseLists
source: Praise Lists
pt: Listas de Louvores

# drawerLogout
source: Logout
pt: Sair

# languagePortuguese
source: Portuguese
pt: Português

# languageEnglish
source: English
pt: Inglês

# languageCurrent
source: Current language: {name}
pt: Idioma atual: {name}

# cardPraises
source: Praises
pt: Louvores

# cardTags
source: Tags
pt: Etiquetas

# cardMaterialKinds
source: Material Kinds
pt: Categorias do Material

# cardLists
source: Lists
pt: Listas

# labelPraisesCount
source: {count} praise(s)
pt: {count} louvor(es)

# labelBy
source: by
pt: por
